as77780/STM32F767/Core/Src/main.cpp
}

/* USER CODE BEGIN 4 */
void hw_init(void){
	  BSP_QSPI_Init();
	  BSP_QSPI_EnableMemoryMappedMode();
}

void HAL_TIM_IC_CaptureCallback(TIM_HandleTypeDef *htim){
	uint16_t cnt1;


	if(htim->Instance==TIM2){
		 capture_is_ready = 1;
		 direction = (TIM2->CR1 & TIM_CR1_DIR ? FORWARD : BACKWARD);
		 cnt1=(direction==FORWARD ? 0 : 1);
		 osMessagePut(QueueIncoderHandle,cnt1,1000);
	}

	if (htim->Instance==TIM3) {
	      //  NEC_TIM_IC_CaptureCallback(&nec);
	    }


}
void ds18b20init (void)
{
	 ow_init(&ow, NULL);
		 if (scan_onewire_devices(&ow, rom_ids, OW_ARRAYSIZE(rom_ids), &rom_found) == owOK) {
		            printf("Devices scanned, found %d devices!\r\n", (int)rom_found);
		        } else {
		            printf("Device scan error\r\n");
		        }
		        if (rom_found == 0) {

		        }
}

void temp_check(uint8_t t_pow,uint8_t t_amp){


	if((35<t_amp)&&(t_amp<50)){
		if(((t_amp - 30)*((uint8_t)(t_amp/10)))>15){
		TIM4->CCR1=(t_amp - 30)*((uint8_t)(t_amp/10));
		                }
			       }
	 if  (t_amp>=50) {
		TIM4->CCR1=100;
	}
	if(t_amp<=35) {
		TIM4->CCR1=10;
	}



	if((40<t_pow)&&(t_pow<50)){
			if(((t_pow - 30)*((uint8_t)(t_pow/10)))>20){
			TIM4->CCR2=(t_pow - 30)*((uint8_t)(t_pow/10));
			}
		}
		 if (t_pow>=50) {
			TIM4->CCR2=100;
		}
		 if(t_pow<=40) {
			TIM4->CCR2=20;
		}

}


/* USER CODE END 4 */

/* USER CODE BEGIN Header_StartDefaultTask */
/**
  * @brief  Function implementing the defaultTask thread.
  * @param  argument: Not used 
  * @retval None
  */
/* USER CODE END Header_StartDefaultTask */
void StartDefaultTask(void const * argument)
{
  /* init code for LWIP */
  MX_LWIP_Init();

/* Graphic application */
  GRAPHICS_MainTask();
  /* USER CODE BEGIN 5 */
  /* Infinite loop */
  for(;;)
  {
    osDelay(10);
  }
  /* USER CODE END 5 */ 
}

/* USER CODE BEGIN Header_StartTaskNet01 */
/**
* @brief Function implementing the TaskNet01 thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartTaskNet01 */
void StartTaskNet01(void const * argument)
{
  /* USER CODE BEGIN StartTaskNet01 */
	volatile struct_arg *arg;
    arg = (struct_arg*) argument;
  /* Infinite loop */
  for(;;)
  {
	  NetRouting(arg->N_task);
    osDelay(1);
  }
  /* USER CODE END StartTaskNet01 */
}

/* CallbackTimer01 function */
void CallbackTimer01(void const * argument)
{
  /* USER CODE BEGIN CallbackTimer01 */
	enum sensor {t_power=0,T_sound};
		struct_temp *qstruct;
		qstruct =(struct_temp*) osMailAlloc(mail, osWaitForever);

	ow_ds18x20_start(&ow, NULL);
		    if (rom_found) {
		                for (size_t i = 0; i < rom_found; i++) {
		                   if (ow_ds18x20_is_b(&ow, &rom_ids[i])) {
		                       float temp;
		                    uint8_t resolution = ow_ds18x20_get_resolution(&ow, &rom_ids[i]);
		                       if (ow_ds18x20_read(&ow, &rom_ids[i], &temp)) {
		                         //  printf("Sensor %02u temperature is %d.%d degrees (%u bits resolution)\r\n",
		                         //      (unsigned)i, (int)temp, (int)((temp * 1000.0f) - (((int)temp) * 1000)), (unsigned)resolution);

		                           tp[i]=temp;
		                           qstruct->temper[i]=temp;
		                       } else {
		                    //       printf("Could not read temperature on sensor %u\r\n", (unsigned)i);
		                       }
		                   }
		               }

		           }
		    temp_check((uint8_t)tp[t_power],(uint8_t)tp[T_sound]);
		    osMailPut(mail, qstruct);


  /* USER CODE END CallbackTimer01 */
}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM14 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM14) {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */

  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{ 
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
